using System;

namespace Matrix
{
    public class MatrixSymbols
    {
        public static char[] Symbols = { 
            'a', 'b', 'c', 'd', 'e', 
            'f', 'g', 'h', 'i', 'j', 
            'k', 'l', 'm', 'n', 'o', 
            'p', 'q', 'r', 's', 't', 
            'u', 'v', 'w', 'x', 'y', 
            'z', '0', '1', '2', '3', 
            '4', '5', '6', '7', '8', 
            '9', '!', '@', '#', '$', 
            '%', '^', '&', '*', '(', 
            '+', '_', '=', '-', ')', 
            '[', '{', ']', '}', '|',
            ' ', '日', ' ', 'ﾊ', 'ﾐ', 
            'ﾋ', 'ｰ', 'ｳ', 'ｼ', 'ﾅ', 
            'ﾓ', 'ﾆ', 'ｻ', 'ﾜ', 'ﾂ', 
            'ｵ', 'ﾘ', 'ｱ', 'ﾎ', 'ﾃ', 
            'ﾏ', 'ｹ', 'ﾒ', 'ｴ', 'ｶ', 
            'ｷ', 'ﾑ', 'ﾕ', 'ﾗ', 'ｾ', 
            'ﾈ', 'ｽ', 'ﾀ', 'ﾇ', 'ﾍ',
            'ｦ', 'ｲ', 'ｸ', 'ｺ', 'ｿ', 
            'ﾁ', 'ﾄ', 'ﾉ', 'ﾌ', 'ﾔ', 
            'ﾖ', 'ﾙ', 'ﾚ', 'ﾛ', 'ﾝ',
            '<', '>', '¦', 'ç', 'ﾘ',
            'ｸ', 'ソ', 'コ', '╌', '二',
            ':', '.', '・', '/', '∙',
            '\\', 'ﾈ', 'ﾎ', 'ﾔ', '異', 
            '体', '字', '辞', '典', '秦', 
            '系', '文', '字', '研', '究',
            '从', '漢', '字', '史', '的', 
            '角', '度', '考', '察', '湖', 
            '北', '辭', '書', '出', '版', 
            '社', '和', '四', '川', '辭', 
            '書', '出', '版', '社', '漢', 
            '語', '大', '字', '典', '文', 
            '字', '學', '概', '要', 'ᔭ',
            '⅋', 'Ɛ', 'Ɫ', '؛', '∀',
            'Ↄ', '◖', 'Ǝ', 'Ⅎ', '∵', 
            '⅁', 'ſ', '⋊', '⅂', '¬', 
            'ᴎ', 'Ԁ', 'Ό', 'ᴚ', '⊥', 
            '∩', 'ᴧ', '⅄', '‾','ɐ', 
            'q', 'ɔ', 'ǝ', 'ɟ', 'ƃ', 
            'ɥ', 'ı', 'ɾ', 'ʞ', 'ʃ', 
            'ɯ', 'ɹ', 'ʇ', 'ʎ', '⁀', 
            '‿', '∴', '⁅', '⁆'
        };

        public static char GetChar(int index)
        {
            if (index >= 0 && index < Symbols.Length)
            {
                return Symbols[index];
            }
            else
            {
                return GetRandomChar();
            }
        }

        public static char GetRandomChar()
        {
            Random random = new Random();
            return GetChar(random.Next(0, Symbols.Length));
        }
    }
}